MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ64MC710/mcu.h
#define _C1RXFUL2_RXFUL22_POSITION               0x00000006
#define _C1RXFUL2_RXFUL22_MASK                   0x00000040
#define _C1RXFUL2_RXFUL22_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL23_POSITION               0x00000007
#define _C1RXFUL2_RXFUL23_MASK                   0x00000080
#define _C1RXFUL2_RXFUL23_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL24_POSITION               0x00000008
#define _C1RXFUL2_RXFUL24_MASK                   0x00000100
#define _C1RXFUL2_RXFUL24_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL25_POSITION               0x00000009
#define _C1RXFUL2_RXFUL25_MASK                   0x00000200
#define _C1RXFUL2_RXFUL25_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL26_POSITION               0x0000000A
#define _C1RXFUL2_RXFUL26_MASK                   0x00000400
#define _C1RXFUL2_RXFUL26_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL27_POSITION               0x0000000B
#define _C1RXFUL2_RXFUL27_MASK                   0x00000800
#define _C1RXFUL2_RXFUL27_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL28_POSITION               0x0000000C
#define _C1RXFUL2_RXFUL28_MASK                   0x00001000
#define _C1RXFUL2_RXFUL28_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL29_POSITION               0x0000000D
#define _C1RXFUL2_RXFUL29_MASK                   0x00002000
#define _C1RXFUL2_RXFUL29_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL30_POSITION               0x0000000E
#define _C1RXFUL2_RXFUL30_MASK                   0x00004000
#define _C1RXFUL2_RXFUL30_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL31_POSITION               0x0000000F
#define _C1RXFUL2_RXFUL31_MASK                   0x00008000
#define _C1RXFUL2_RXFUL31_LENGTH                 0x00000001

#define _C1BUFPNT3_F8BP_POSITION                 0x00000000
#define _C1BUFPNT3_F8BP_MASK                     0x0000000F
#define _C1BUFPNT3_F8BP_LENGTH                   0x00000004

#define _C1BUFPNT3_F9BP_POSITION                 0x00000004
#define _C1BUFPNT3_F9BP_MASK                     0x000000F0
#define _C1BUFPNT3_F9BP_LENGTH                   0x00000004

#define _C1BUFPNT3_F10BP_POSITION                0x00000008
#define _C1BUFPNT3_F10BP_MASK                    0x00000F00
#define _C1BUFPNT3_F10BP_LENGTH                  0x00000004

#define _C1BUFPNT3_F11BP_POSITION                0x0000000C
#define _C1BUFPNT3_F11BP_MASK                    0x0000F000
#define _C1BUFPNT3_F11BP_LENGTH                  0x00000004

#define _C1BUFPNT4_F12BP_POSITION                0x00000000
#define _C1BUFPNT4_F12BP_MASK                    0x0000000F
#define _C1BUFPNT4_F12BP_LENGTH                  0x00000004

#define _C1BUFPNT4_F13BP_POSITION                0x00000004
#define _C1BUFPNT4_F13BP_MASK                    0x000000F0
#define _C1BUFPNT4_F13BP_LENGTH                  0x00000004

#define _C1BUFPNT4_F14BP_POSITION                0x00000008
#define _C1BUFPNT4_F14BP_MASK                    0x00000F00
#define _C1BUFPNT4_F14BP_LENGTH                  0x00000004

#define _C1BUFPNT4_F15BP_POSITION                0x0000000C
#define _C1BUFPNT4_F15BP_MASK                    0x0000F000
#define _C1BUFPNT4_F15BP_LENGTH                  0x00000004

#define _C1RXOVF1_RXOVF0_POSITION                0x00000000
#define _C1RXOVF1_RXOVF0_MASK                    0x00000001
#define _C1RXOVF1_RXOVF0_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF1_POSITION                0x00000001
#define _C1RXOVF1_RXOVF1_MASK                    0x00000002
#define _C1RXOVF1_RXOVF1_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF2_POSITION                0x00000002
#define _C1RXOVF1_RXOVF2_MASK                    0x00000004
#define _C1RXOVF1_RXOVF2_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF3_POSITION                0x00000003
#define _C1RXOVF1_RXOVF3_MASK                    0x00000008
#define _C1RXOVF1_RXOVF3_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF4_POSITION                0x00000004
#define _C1RXOVF1_RXOVF4_MASK                    0x00000010
#define _C1RXOVF1_RXOVF4_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF5_POSITION                0x00000005
#define _C1RXOVF1_RXOVF5_MASK                    0x00000020
#define _C1RXOVF1_RXOVF5_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF6_POSITION                0x00000006
#define _C1RXOVF1_RXOVF6_MASK                    0x00000040
#define _C1RXOVF1_RXOVF6_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF7_POSITION                0x00000007
#define _C1RXOVF1_RXOVF7_MASK                    0x00000080
#define _C1RXOVF1_RXOVF7_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF8_POSITION                0x00000008
#define _C1RXOVF1_RXOVF8_MASK                    0x00000100
#define _C1RXOVF1_RXOVF8_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF9_POSITION                0x00000009
#define _C1RXOVF1_RXOVF9_MASK                    0x00000200
#define _C1RXOVF1_RXOVF9_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF10_POSITION               0x0000000A
#define _C1RXOVF1_RXOVF10_MASK                   0x00000400
#define _C1RXOVF1_RXOVF10_LENGTH                 0x00000001

#define _C1RXOVF1_RXOVF11_POSITION               0x0000000B
#define _C1RXOVF1_RXOVF11_MASK                   0x00000800
#define _C1RXOVF1_RXOVF11_LENGTH                 0x00000001

#define _C1RXOVF1_RXOVF12_POSITION               0x0000000C
#define _C1RXOVF1_RXOVF12_MASK                   0x00001000
#define _C1RXOVF1_RXOVF12_LENGTH                 0x00000001

#define _C1RXOVF1_RXOVF13_POSITION               0x0000000D
#define _C1RXOVF1_RXOVF13_MASK                   0x00002000
#define _C1RXOVF1_RXOVF13_LENGTH                 0x00000001

#define _C1RXOVF1_RXOVF14_POSITION               0x0000000E
#define _C1RXOVF1_RXOVF14_MASK                   0x00004000
#define _C1RXOVF1_RXOVF14_LENGTH                 0x00000001

#define _C1RXOVF1_RXOVF15_POSITION               0x0000000F
#define _C1RXOVF1_RXOVF15_MASK                   0x00008000
#define _C1RXOVF1_RXOVF15_LENGTH                 0x00000001

